maxboss10086/max_dsp/max/F28388D/F28388_empty_project/device/driverlib/inc/hw_memcfg.h
//*****************************************************************************
//
// The following are defines for the bit fields in the LSXACCPROT0 register
//
//*****************************************************************************
#define MEMCFG_LSXACCPROT0_FETCHPROT_LS0  0x1U         // Fetch Protection For LS0 RAM
#define MEMCFG_LSXACCPROT0_CPUWRPROT_LS0  0x2U         // CPU WR Protection For LS0 RAM
#define MEMCFG_LSXACCPROT0_FETCHPROT_LS1  0x100U       // Fetch Protection For LS1 RAM
#define MEMCFG_LSXACCPROT0_CPUWRPROT_LS1  0x200U       // CPU WR Protection For LS1 RAM
#define MEMCFG_LSXACCPROT0_FETCHPROT_LS2  0x10000U     // Fetch Protection For LS2 RAM
#define MEMCFG_LSXACCPROT0_CPUWRPROT_LS2  0x20000U     // CPU WR Protection For LS2 RAM
#define MEMCFG_LSXACCPROT0_FETCHPROT_LS3  0x1000000U   // Fetch Protection For LS3 RAM
#define MEMCFG_LSXACCPROT0_CPUWRPROT_LS3  0x2000000U   // CPU WR Protection For LS3 RAM

//*****************************************************************************
//
// The following are defines for the bit fields in the LSXACCPROT1 register
//
//*****************************************************************************
#define MEMCFG_LSXACCPROT1_FETCHPROT_LS4  0x1U         // Fetch Protection For LS4 RAM
#define MEMCFG_LSXACCPROT1_CPUWRPROT_LS4  0x2U         // CPU WR Protection For LS4 RAM
#define MEMCFG_LSXACCPROT1_FETCHPROT_LS5  0x100U       // Fetch Protection For LS5 RAM
#define MEMCFG_LSXACCPROT1_CPUWRPROT_LS5  0x200U       // CPU WR Protection For LS5 RAM
#define MEMCFG_LSXACCPROT1_FETCHPROT_LS6  0x10000U     // Fetch Protection For LS6 RAM
#define MEMCFG_LSXACCPROT1_CPUWRPROT_LS6  0x20000U     // CPU WR Protection For LS6 RAM
#define MEMCFG_LSXACCPROT1_FETCHPROT_LS7  0x1000000U   // Fetch Protection For LS7 RAM
#define MEMCFG_LSXACCPROT1_CPUWRPROT_LS7  0x2000000U   // CPU WR Protection For LS7 RAM

//*****************************************************************************
//
// The following are defines for the bit fields in the LSXTEST register
//
//*****************************************************************************
#define MEMCFG_LSXTEST_TEST_LS0_S  0U
#define MEMCFG_LSXTEST_TEST_LS0_M  0x3U         // Selects the different modes
                                               // for LS0 RAM
#define MEMCFG_LSXTEST_TEST_LS1_S  2U
#define MEMCFG_LSXTEST_TEST_LS1_M  0xCU         // Selects the different modes
                                               // for LS1 RAM
#define MEMCFG_LSXTEST_TEST_LS2_S  4U
#define MEMCFG_LSXTEST_TEST_LS2_M  0x30U        // Selects the different modes
                                               // for LS2 RAM
#define MEMCFG_LSXTEST_TEST_LS3_S  6U
#define MEMCFG_LSXTEST_TEST_LS3_M  0xC0U        // Selects the different modes
                                               // for LS3 RAM
#define MEMCFG_LSXTEST_TEST_LS4_S  8U
#define MEMCFG_LSXTEST_TEST_LS4_M  0x300U       // Selects the different modes
                                               // for LS4 RAM
#define MEMCFG_LSXTEST_TEST_LS5_S  10U
#define MEMCFG_LSXTEST_TEST_LS5_M  0xC00U       // Selects the different modes
                                               // for LS5 RAM
#define MEMCFG_LSXTEST_TEST_LS6_S  12U
#define MEMCFG_LSXTEST_TEST_LS6_M  0x3000U      // Selects the different modes
                                               // for LS6 RAM
#define MEMCFG_LSXTEST_TEST_LS7_S  14U
#define MEMCFG_LSXTEST_TEST_LS7_M  0xC000U      // Selects the different modes
                                               // for LS7 RAM

//*****************************************************************************
//
// The following are defines for the bit fields in the LSXINIT register
//
//*****************************************************************************
#define MEMCFG_LSXINIT_INIT_LS0   0x1U         // RAM Initialization control
                                               // for LS0 RAM.
#define MEMCFG_LSXINIT_INIT_LS1   0x2U         // RAM Initialization control
                                               // for LS1 RAM.
#define MEMCFG_LSXINIT_INIT_LS2   0x4U         // RAM Initialization control
                                               // for LS2 RAM.
#define MEMCFG_LSXINIT_INIT_LS3   0x8U         // RAM Initialization control
                                               // for LS3 RAM.
#define MEMCFG_LSXINIT_INIT_LS4   0x10U        // RAM Initialization control
                                               // for LS4 RAM.
#define MEMCFG_LSXINIT_INIT_LS5   0x20U        // RAM Initialization control
                                               // for LS5 RAM.
#define MEMCFG_LSXINIT_INIT_LS6   0x40U        // RAM Initialization control
                                               // for LS6 RAM.
#define MEMCFG_LSXINIT_INIT_LS7   0x80U        // RAM Initialization control
                                               // for LS7 RAM.

//*****************************************************************************
//
// The following are defines for the bit fields in the LSXINITDONE register
//
//*****************************************************************************
#define MEMCFG_LSXINITDONE_INITDONE_LS0  0x1U         // RAM Initialization status for
                                               // LS0 RAM.
#define MEMCFG_LSXINITDONE_INITDONE_LS1  0x2U         // RAM Initialization status for
                                               // LS1 RAM.
#define MEMCFG_LSXINITDONE_INITDONE_LS2  0x4U         // RAM Initialization status for
                                               // LS2 RAM.
#define MEMCFG_LSXINITDONE_INITDONE_LS3  0x8U         // RAM Initialization status for
                                               // LS3 RAM.
#define MEMCFG_LSXINITDONE_INITDONE_LS4  0x10U        // RAM Initialization status for
                                               // LS4 RAM.
#define MEMCFG_LSXINITDONE_INITDONE_LS5  0x20U        // RAM Initialization status for
                                               // LS5 RAM.
#define MEMCFG_LSXINITDONE_INITDONE_LS6  0x40U        // RAM Initialization status for
                                               // LS6 RAM.
#define MEMCFG_LSXINITDONE_INITDONE_LS7  0x80U        // RAM Initialization status for
                                               // LS7 RAM.

//*****************************************************************************
//
// The following are defines for the bit fields in the LSXRAMTEST_LOCK register
//
//*****************************************************************************
#define MEMCFG_LSXRAMTEST_LOCK_LS0  0x1U         // LSxTEST.TEST_LS0 LOCK
#define MEMCFG_LSXRAMTEST_LOCK_LS1  0x2U         // LSxTEST.TEST_LS1 LOCK
#define MEMCFG_LSXRAMTEST_LOCK_LS2  0x4U         // LSxTEST.TEST_LS2 LOCK
#define MEMCFG_LSXRAMTEST_LOCK_LS3  0x8U         // LSxTEST.TEST_LS3 LOCK
#define MEMCFG_LSXRAMTEST_LOCK_LS4  0x10U        // LSxTEST.TEST_LS4 LOCK
#define MEMCFG_LSXRAMTEST_LOCK_LS5  0x20U        // LSxTEST.TEST_LS5 LOCK
#define MEMCFG_LSXRAMTEST_LOCK_LS6  0x40U        // LSxTEST.TEST_LS6 LOCK
#define MEMCFG_LSXRAMTEST_LOCK_LS7  0x80U        // LSxTEST.TEST_LS7 LOCK
#define MEMCFG_LSXRAMTEST_LOCK_KEY_S  16U
#define MEMCFG_LSXRAMTEST_LOCK_KEY_M  0xFFFF0000U  // KEY field

//*****************************************************************************
//
// The following are defines for the bit fields in the GSXLOCK register
//
//*****************************************************************************
#define MEMCFG_GSXLOCK_LOCK_GS0   0x1U         // GS0 RAM Lock bits
#define MEMCFG_GSXLOCK_LOCK_GS1   0x2U         // GS1 RAM Lock bits
#define MEMCFG_GSXLOCK_LOCK_GS2   0x4U         // GS2 RAM Lock bits
#define MEMCFG_GSXLOCK_LOCK_GS3   0x8U         // GS3 RAM Lock bits
#define MEMCFG_GSXLOCK_LOCK_GS4   0x10U        // GS4 RAM Lock bits
#define MEMCFG_GSXLOCK_LOCK_GS5   0x20U        // GS5 RAM Lock bits
#define MEMCFG_GSXLOCK_LOCK_GS6   0x40U        // GS6 RAM Lock bits
#define MEMCFG_GSXLOCK_LOCK_GS7   0x80U        // GS7 RAM Lock bits
#define MEMCFG_GSXLOCK_LOCK_GS8   0x100U       // GS8 RAM Lock bits
#define MEMCFG_GSXLOCK_LOCK_GS9   0x200U       // GS9 RAM Lock bits
#define MEMCFG_GSXLOCK_LOCK_GS10  0x400U       // GS10 RAM Lock bits
#define MEMCFG_GSXLOCK_LOCK_GS11  0x800U       // GS11 RAM Lock bits
#define MEMCFG_GSXLOCK_LOCK_GS12  0x1000U      // GS12 RAM Lock bits
#define MEMCFG_GSXLOCK_LOCK_GS13  0x2000U      // GS13 RAM Lock bits
#define MEMCFG_GSXLOCK_LOCK_GS14  0x4000U      // GS14 RAM Lock bits
#define MEMCFG_GSXLOCK_LOCK_GS15  0x8000U      // GS15 RAM Lock bits

//*****************************************************************************
//
// The following are defines for the bit fields in the GSXCOMMIT register
//
//*****************************************************************************
#define MEMCFG_GSXCOMMIT_COMMIT_GS0  0x1U         // GS0 RAM Permanent Lock bits
#define MEMCFG_GSXCOMMIT_COMMIT_GS1  0x2U         // GS1 RAM Permanent Lock bits
#define MEMCFG_GSXCOMMIT_COMMIT_GS2  0x4U         // GS2 RAM Permanent Lock bits
#define MEMCFG_GSXCOMMIT_COMMIT_GS3  0x8U         // GS3 RAM Permanent Lock bits
#define MEMCFG_GSXCOMMIT_COMMIT_GS4  0x10U        // GS4 RAM Permanent Lock bits
#define MEMCFG_GSXCOMMIT_COMMIT_GS5  0x20U        // GS5 RAM Permanent Lock bits
#define MEMCFG_GSXCOMMIT_COMMIT_GS6  0x40U        // GS6 RAM Permanent Lock bits
#define MEMCFG_GSXCOMMIT_COMMIT_GS7  0x80U        // GS7 RAM Permanent Lock bits
#define MEMCFG_GSXCOMMIT_COMMIT_GS8  0x100U       // GS8 RAM Permanent Lock bits
#define MEMCFG_GSXCOMMIT_COMMIT_GS9  0x200U       // GS9 RAM Permanent Lock bits
#define MEMCFG_GSXCOMMIT_COMMIT_GS10  0x400U       // GS10 RAM Permanent Lock bits
#define MEMCFG_GSXCOMMIT_COMMIT_GS11  0x800U       // GS11 RAM Permanent Lock bits
#define MEMCFG_GSXCOMMIT_COMMIT_GS12  0x1000U      // GS12 RAM Permanent Lock bits
#define MEMCFG_GSXCOMMIT_COMMIT_GS13  0x2000U      // GS13 RAM Permanent Lock bits
#define MEMCFG_GSXCOMMIT_COMMIT_GS14  0x4000U      // GS14 RAM Permanent Lock bits
#define MEMCFG_GSXCOMMIT_COMMIT_GS15  0x8000U      // GS15 RAM Permanent Lock bits

//*****************************************************************************
//
// The following are defines for the bit fields in the GSXMSEL register
//
//*****************************************************************************
#define MEMCFG_GSXMSEL_MSEL_GS0   0x1U         // Master Select for GS0 RAM
#define MEMCFG_GSXMSEL_MSEL_GS1   0x2U         // Master Select for GS1 RAM
#define MEMCFG_GSXMSEL_MSEL_GS2   0x4U         // Master Select for GS2 RAM
#define MEMCFG_GSXMSEL_MSEL_GS3   0x8U         // Master Select for GS3 RAM
#define MEMCFG_GSXMSEL_MSEL_GS4   0x10U        // Master Select for GS4 RAM
#define MEMCFG_GSXMSEL_MSEL_GS5   0x20U        // Master Select for GS5 RAM
#define MEMCFG_GSXMSEL_MSEL_GS6   0x40U        // Master Select for GS6 RAM
#define MEMCFG_GSXMSEL_MSEL_GS7   0x80U        // Master Select for GS7 RAM
#define MEMCFG_GSXMSEL_MSEL_GS8   0x100U       // Master Select for GS8 RAM
#define MEMCFG_GSXMSEL_MSEL_GS9   0x200U       // Master Select for GS9 RAM
#define MEMCFG_GSXMSEL_MSEL_GS10  0x400U       // Master Select for GS10 RAM
#define MEMCFG_GSXMSEL_MSEL_GS11  0x800U       // Master Select for GS11 RAM
#define MEMCFG_GSXMSEL_MSEL_GS12  0x1000U      // Master Select for GS12 RAM
#define MEMCFG_GSXMSEL_MSEL_GS13  0x2000U      // Master Select for GS13 RAM
#define MEMCFG_GSXMSEL_MSEL_GS14  0x4000U      // Master Select for GS14 RAM
#define MEMCFG_GSXMSEL_MSEL_GS15  0x8000U      // Master Select for GS15 RAM

//*****************************************************************************
//
// The following are defines for the bit fields in the GSXACCPROT0 register
//
//*****************************************************************************
#define MEMCFG_GSXACCPROT0_FETCHPROT_GS0  0x1U         // Fetch Protection For GS0 RAM
#define MEMCFG_GSXACCPROT0_CPUWRPROT_GS0  0x2U         // CPU WR Protection For GS0 RAM
#define MEMCFG_GSXACCPROT0_DMAWRPROT_GS0  0x4U         // DMA WR Protection For GS0 RAM
#define MEMCFG_GSXACCPROT0_FETCHPROT_GS1  0x100U       // Fetch Protection For GS1 RAM
#define MEMCFG_GSXACCPROT0_CPUWRPROT_GS1  0x200U       // CPU WR Protection For GS1 RAM
#define MEMCFG_GSXACCPROT0_DMAWRPROT_GS1  0x400U       // DMA WR Protection For GS1 RAM
#define MEMCFG_GSXACCPROT0_FETCHPROT_GS2  0x10000U     // Fetch Protection For GS2 RAM
#define MEMCFG_GSXACCPROT0_CPUWRPROT_GS2  0x20000U     // CPU WR Protection For GS2 RAM
#define MEMCFG_GSXACCPROT0_DMAWRPROT_GS2  0x40000U     // DMA WR Protection For GS2 RAM
#define MEMCFG_GSXACCPROT0_FETCHPROT_GS3  0x1000000U   // Fetch Protection For GS3 RAM
#define MEMCFG_GSXACCPROT0_CPUWRPROT_GS3  0x2000000U   // CPU WR Protection For GS3 RAM
#define MEMCFG_GSXACCPROT0_DMAWRPROT_GS3  0x4000000U   // DMA WR Protection For GS3 RAM

//*****************************************************************************
//
// The following are defines for the bit fields in the GSXACCPROT1 register
//
//*****************************************************************************
#define MEMCFG_GSXACCPROT1_FETCHPROT_GS4  0x1U         // Fetch Protection For GS4 RAM
#define MEMCFG_GSXACCPROT1_CPUWRPROT_GS4  0x2U         // CPU WR Protection For GS4 RAM
#define MEMCFG_GSXACCPROT1_DMAWRPROT_GS4  0x4U         // DMA WR Protection For GS4 RAM
#define MEMCFG_GSXACCPROT1_FETCHPROT_GS5  0x100U       // Fetch Protection For GS5 RAM
#define MEMCFG_GSXACCPROT1_CPUWRPROT_GS5  0x200U       // CPU WR Protection For GS5 RAM
#define MEMCFG_GSXACCPROT1_DMAWRPROT_GS5  0x400U       // DMA WR Protection For GS5RAM
#define MEMCFG_GSXACCPROT1_FETCHPROT_GS6  0x10000U     // Fetch Protection For GS6 RAM
#define MEMCFG_GSXACCPROT1_CPUWRPROT_GS6  0x20000U     // CPU WR Protection For GS6 RAM
#define MEMCFG_GSXACCPROT1_DMAWRPROT_GS6  0x40000U     // DMA WR Protection For GS6RAM
#define MEMCFG_GSXACCPROT1_FETCHPROT_GS7  0x1000000U   // Fetch Protection For GS7 RAM
#define MEMCFG_GSXACCPROT1_CPUWRPROT_GS7  0x2000000U   // CPU WR Protection For GS7 RAM
#define MEMCFG_GSXACCPROT1_DMAWRPROT_GS7  0x4000000U   // DMA WR Protection For GS7RAM

//*****************************************************************************
//
// The following are defines for the bit fields in the GSXACCPROT2 register
//
//*****************************************************************************
#define MEMCFG_GSXACCPROT2_FETCHPROT_GS8  0x1U         // Fetch Protection For GS8 RAM
#define MEMCFG_GSXACCPROT2_CPUWRPROT_GS8  0x2U         // CPU WR Protection For GS8 RAM
#define MEMCFG_GSXACCPROT2_DMAWRPROT_GS8  0x4U         // DMA WR Protection For GS8 RAM
#define MEMCFG_GSXACCPROT2_FETCHPROT_GS9  0x100U       // Fetch Protection For GS9 RAM
#define MEMCFG_GSXACCPROT2_CPUWRPROT_GS9  0x200U       // CPU WR Protection For GS9 RAM
#define MEMCFG_GSXACCPROT2_DMAWRPROT_GS9  0x400U       // DMA WR Protection For GS9RAM
#define MEMCFG_GSXACCPROT2_FETCHPROT_GS10  0x10000U     // Fetch Protection For GS10 RAM
#define MEMCFG_GSXACCPROT2_CPUWRPROT_GS10  0x20000U     // CPU WR Protection For GS10
                                               // RAM
#define MEMCFG_GSXACCPROT2_DMAWRPROT_GS10  0x40000U     // DMA WR Protection For GS10RAM
#define MEMCFG_GSXACCPROT2_FETCHPROT_GS11  0x1000000U   // Fetch Protection For GS11 RAM
#define MEMCFG_GSXACCPROT2_CPUWRPROT_GS11  0x2000000U   // CPU WR Protection For GS11
                                               // RAM
#define MEMCFG_GSXACCPROT2_DMAWRPROT_GS11  0x4000000U   // DMA WR Protection For GS11RAM

//*****************************************************************************
//
// The following are defines for the bit fields in the GSXACCPROT3 register
//
//*****************************************************************************
#define MEMCFG_GSXACCPROT3_FETCHPROT_GS12  0x1U         // Fetch Protection For GS12 RAM
#define MEMCFG_GSXACCPROT3_CPUWRPROT_GS12  0x2U         // CPU WR Protection For GS12
                                               // RAM
#define MEMCFG_GSXACCPROT3_DMAWRPROT_GS12  0x4U         // DMA WR Protection For GS12
                                               // RAM
#define MEMCFG_GSXACCPROT3_FETCHPROT_GS13  0x100U       // Fetch Protection For GS13 RAM
#define MEMCFG_GSXACCPROT3_CPUWRPROT_GS13  0x200U       // CPU WR Protection For GS13
                                               // RAM
#define MEMCFG_GSXACCPROT3_DMAWRPROT_GS13  0x400U       // DMA WR Protection For GS13RAM
#define MEMCFG_GSXACCPROT3_FETCHPROT_GS14  0x10000U     // Fetch Protection For GS14 RAM
#define MEMCFG_GSXACCPROT3_CPUWRPROT_GS14  0x20000U     // CPU WR Protection For GS14
                                               // RAM
#define MEMCFG_GSXACCPROT3_DMAWRPROT_GS14  0x40000U     // DMA WR Protection For GS14RAM
#define MEMCFG_GSXACCPROT3_FETCHPROT_GS15  0x1000000U   // Fetch Protection For GS15 RAM
#define MEMCFG_GSXACCPROT3_CPUWRPROT_GS15  0x2000000U   // CPU WR Protection For GS15
                                               // RAM
#define MEMCFG_GSXACCPROT3_DMAWRPROT_GS15  0x4000000U   // DMA WR Protection For GS15RAM

//*****************************************************************************
//
// The following are defines for the bit fields in the GSXTEST register
//
//*****************************************************************************
#define MEMCFG_GSXTEST_TEST_GS0_S  0U
#define MEMCFG_GSXTEST_TEST_GS0_M  0x3U         // Selects the different modes
                                               // for GS0 RAM
#define MEMCFG_GSXTEST_TEST_GS1_S  2U
#define MEMCFG_GSXTEST_TEST_GS1_M  0xCU         // Selects the different modes
                                               // for GS1 RAM
#define MEMCFG_GSXTEST_TEST_GS2_S  4U
#define MEMCFG_GSXTEST_TEST_GS2_M  0x30U        // Selects the different modes
                                               // for GS2 RAM
#define MEMCFG_GSXTEST_TEST_GS3_S  6U
#define MEMCFG_GSXTEST_TEST_GS3_M  0xC0U        // Selects the different modes
                                               // for GS3 RAM
#define MEMCFG_GSXTEST_TEST_GS4_S  8U
#define MEMCFG_GSXTEST_TEST_GS4_M  0x300U       // Selects the different modes
                                               // for GS4 RAM
#define MEMCFG_GSXTEST_TEST_GS5_S  10U
#define MEMCFG_GSXTEST_TEST_GS5_M  0xC00U       // Selects the different modes
                                               // for GS5 RAM
#define MEMCFG_GSXTEST_TEST_GS6_S  12U
#define MEMCFG_GSXTEST_TEST_GS6_M  0x3000U      // Selects the different modes
                                               // for GS6 RAM
#define MEMCFG_GSXTEST_TEST_GS7_S  14U
#define MEMCFG_GSXTEST_TEST_GS7_M  0xC000U      // Selects the different modes
                                               // for GS7 RAM
#define MEMCFG_GSXTEST_TEST_GS8_S  16U
#define MEMCFG_GSXTEST_TEST_GS8_M  0x30000U     // Selects the different modes
                                               // for GS8 RAM
#define MEMCFG_GSXTEST_TEST_GS9_S  18U
#define MEMCFG_GSXTEST_TEST_GS9_M  0xC0000U     // Selects the different modes
                                               // for GS9 RAM
#define MEMCFG_GSXTEST_TEST_GS10_S  20U
#define MEMCFG_GSXTEST_TEST_GS10_M  0x300000U    // Selects the different modes
                                               // for GS10 RAM
#define MEMCFG_GSXTEST_TEST_GS11_S  22U
#define MEMCFG_GSXTEST_TEST_GS11_M  0xC00000U    // Selects the different modes
                                               // for GS11 RAM
#define MEMCFG_GSXTEST_TEST_GS12_S  24U
#define MEMCFG_GSXTEST_TEST_GS12_M  0x3000000U   // Selects the different modes
                                               // for GS12 RAM
#define MEMCFG_GSXTEST_TEST_GS13_S  26U
#define MEMCFG_GSXTEST_TEST_GS13_M  0xC000000U   // Selects the different modes
                                               // for GS13 RAM
#define MEMCFG_GSXTEST_TEST_GS14_S  28U
#define MEMCFG_GSXTEST_TEST_GS14_M  0x30000000U  // Selects the different modes
                                               // for GS14 RAM
#define MEMCFG_GSXTEST_TEST_GS15_S  30U
#define MEMCFG_GSXTEST_TEST_GS15_M  0xC0000000U  // Selects the different modes
                                               // for GS15 RAM

//*****************************************************************************
//
// The following are defines for the bit fields in the GSXINIT register
//
//*****************************************************************************
#define MEMCFG_GSXINIT_INIT_GS0   0x1U         // RAM Initialization control
                                               // for GS0 RAM.
#define MEMCFG_GSXINIT_INIT_GS1   0x2U         // RAM Initialization control
                                               // for GS1 RAM.
#define MEMCFG_GSXINIT_INIT_GS2   0x4U         // RAM Initialization control
                                               // for GS2 RAM.
#define MEMCFG_GSXINIT_INIT_GS3   0x8U         // RAM Initialization control
                                               // for GS3 RAM.
#define MEMCFG_GSXINIT_INIT_GS4   0x10U        // RAM Initialization control
                                               // for GS4 RAM.
#define MEMCFG_GSXINIT_INIT_GS5   0x20U        // RAM Initialization control
                                               // for GS5 RAM.
#define MEMCFG_GSXINIT_INIT_GS6   0x40U        // RAM Initialization control
                                               // for GS6 RAM.
#define MEMCFG_GSXINIT_INIT_GS7   0x80U        // RAM Initialization control
                                               // for GS7 RAM.
#define MEMCFG_GSXINIT_INIT_GS8   0x100U       // RAM Initialization control
                                               // for GS8 RAM.
#define MEMCFG_GSXINIT_INIT_GS9   0x200U       // RAM Initialization control
                                               // for GS9 RAM.
#define MEMCFG_GSXINIT_INIT_GS10  0x400U       // RAM Initialization control
                                               // for GS10 RAM.
#define MEMCFG_GSXINIT_INIT_GS11  0x800U       // RAM Initialization control
                                               // for GS11 RAM.
#define MEMCFG_GSXINIT_INIT_GS12  0x1000U      // RAM Initialization control
                                               // for GS12 RAM.
#define MEMCFG_GSXINIT_INIT_GS13  0x2000U      // RAM Initialization control
                                               // for GS13 RAM.
#define MEMCFG_GSXINIT_INIT_GS14  0x4000U      // RAM Initialization control
                                               // for GS14 RAM.
#define MEMCFG_GSXINIT_INIT_GS15  0x8000U      // RAM Initialization control
                                               // for GS15 RAM.

