maxboss10086/max_dsp/max/F28388D/F28388_empty_project/device/driverlib/inc/hw_memcfg.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GSXINITDONE register
//
//*****************************************************************************
#define MEMCFG_GSXINITDONE_INITDONE_GS0  0x1U         // RAM Initialization status for
                                               // GS0 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS1  0x2U         // RAM Initialization status for
                                               // GS1 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS2  0x4U         // RAM Initialization status for
                                               // GS2 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS3  0x8U         // RAM Initialization status for
                                               // GS3 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS4  0x10U        // RAM Initialization status for
                                               // GS4 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS5  0x20U        // RAM Initialization status for
                                               // GS5 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS6  0x40U        // RAM Initialization status for
                                               // GS6 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS7  0x80U        // RAM Initialization status for
                                               // GS7 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS8  0x100U       // RAM Initialization status for
                                               // GS8 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS9  0x200U       // RAM Initialization status for
                                               // GS9 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS10  0x400U       // RAM Initialization status for
                                               // GS10 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS11  0x800U       // RAM Initialization status for
                                               // GS11 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS12  0x1000U      // RAM Initialization status for
                                               // GS12 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS13  0x2000U      // RAM Initialization status for
                                               // GS13 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS14  0x4000U      // RAM Initialization status for
                                               // GS14 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS15  0x8000U      // RAM Initialization status for
                                               // GS15 RAM.

//*****************************************************************************
//
// The following are defines for the bit fields in the GSXRAMTEST_LOCK register
//
//*****************************************************************************
#define MEMCFG_GSXRAMTEST_LOCK_GS0  0x1U         // GSxTEST.TEST_GS0 LOCK
#define MEMCFG_GSXRAMTEST_LOCK_GS1  0x2U         // GSxTEST.TEST_GS1 LOCK
#define MEMCFG_GSXRAMTEST_LOCK_GS2  0x4U         // GSxTEST.TEST_GS2 LOCK
#define MEMCFG_GSXRAMTEST_LOCK_GS3  0x8U         // GSxTEST.TEST_GS3 LOCK
#define MEMCFG_GSXRAMTEST_LOCK_GS4  0x10U        // GSxTEST.TEST_GS4 LOCK
#define MEMCFG_GSXRAMTEST_LOCK_GS5  0x20U        // GSxTEST.TEST_GS5 LOCK
#define MEMCFG_GSXRAMTEST_LOCK_GS6  0x40U        // GSxTEST.TEST_GS6 LOCK
#define MEMCFG_GSXRAMTEST_LOCK_GS7  0x80U        // GSxTEST.TEST_GS7 LOCK
#define MEMCFG_GSXRAMTEST_LOCK_GS8  0x100U       // GSxTEST.TEST_GS8 LOCK
#define MEMCFG_GSXRAMTEST_LOCK_GS9  0x200U       // GSxTEST.TEST_GS9 LOCK
#define MEMCFG_GSXRAMTEST_LOCK_GS10  0x400U       // GSxTEST.TEST_GS10 LOCK
#define MEMCFG_GSXRAMTEST_LOCK_GS11  0x800U       // GSxTEST.TEST_GS11 LOCK
#define MEMCFG_GSXRAMTEST_LOCK_GS12  0x1000U      // GSxTEST.TEST_GS12 LOCK
#define MEMCFG_GSXRAMTEST_LOCK_GS13  0x2000U      // GSxTEST.TEST_GS13 LOCK
#define MEMCFG_GSXRAMTEST_LOCK_GS14  0x4000U      // GSxTEST.TEST_GS14 LOCK
#define MEMCFG_GSXRAMTEST_LOCK_GS15  0x8000U      // GSxTEST.TEST_GS15 LOCK
#define MEMCFG_GSXRAMTEST_LOCK_KEY_S  16U
#define MEMCFG_GSXRAMTEST_LOCK_KEY_M  0xFFFF0000U  // KEY field

//*****************************************************************************
//
// The following are defines for the bit fields in the MSGXLOCK register
//
//*****************************************************************************
#define MEMCFG_MSGXLOCK_LOCK_CPUTOCPU_MSGRAM0  0x1U         // CPUTOCPU RAM Lock bits
#define MEMCFG_MSGXLOCK_LOCK_CPUTOCLA1  0x2U         // CPUTOCLA1 RAM Lock bits
#define MEMCFG_MSGXLOCK_LOCK_CLA1TOCPU  0x4U         // CLA1TOCPU RAM Lock bits
#define MEMCFG_MSGXLOCK_LOCK_CLA1TODMA  0x20U        // CLA1TODMA RAM control fields
                                               // lock bit
#define MEMCFG_MSGXLOCK_LOCK_DMATOCLA1  0x40U        // DMATOCLA1 RAM control fields
                                               // lock bit
#define MEMCFG_MSGXLOCK_LOCK_CPUTOCPU_MSGRAM1  0x80U        // Lock bit of CPU to CPU MSG
                                               // RAM1 control fields
#define MEMCFG_MSGXLOCK_LOCK_CPUTOCM_MSGRAM0  0x100U       // Lock bit of CPU to CM MSG
                                               // RAM0 control fields
#define MEMCFG_MSGXLOCK_LOCK_CPUTOCM_MSGRAM1  0x200U       // Lock bit of CPU to CM MSG
                                               // RAM1 control fields
#define MEMCFG_MSGXLOCK_LOCK_CLA2TODMA  0x400U       // Lock bit of CLA to DMA MSG
                                               // RAM control fields
#define MEMCFG_MSGXLOCK_LOCK_DMATOCLA2  0x800U       // Lock bit of DMA to CLA MSG
                                               // RAM control fields

//*****************************************************************************
//
// The following are defines for the bit fields in the MSGXCOMMIT register
//
//*****************************************************************************
#define MEMCFG_MSGXCOMMIT_COMMIT_CPUTOCPU_MSGRAM0  0x1U         // CPUTOCPU RAM control fields
                                               // COMMIT bit
#define MEMCFG_MSGXCOMMIT_COMMIT_CPUTOCLA1  0x2U         // CPUTOCLA1 RAM control fields
                                               // COMMIT bit
#define MEMCFG_MSGXCOMMIT_COMMIT_CLA1TOCPU  0x4U         // CLA1TOCPU RAM control fields
                                               // COMMIT bit
#define MEMCFG_MSGXCOMMIT_COMMIT_CLA1TODMA  0x20U        // CLA1TODMA RAM control fields
                                               // COMMIT bit
#define MEMCFG_MSGXCOMMIT_COMMIT_DMATOCLA1  0x40U        // DMATOCLA1 RAM control fields
                                               // COMMIT bit
#define MEMCFG_MSGXCOMMIT_COMMIT_CPUTOCPU_MSGRAM1  0x80U        // Commint bit of CPU to CPU MSG
                                               // RAM1 control fields
#define MEMCFG_MSGXCOMMIT_COMMIT_CPUTOCM_MSGRAM0  0x100U       // Commint bit of CPU to CM MSG
                                               // RAM0 control fields
#define MEMCFG_MSGXCOMMIT_COMMIT_CPUTOCM_MSGRAM1  0x200U       // Commint bit of CPU to CM MSG
                                               // RAM1 control fields
#define MEMCFG_MSGXCOMMIT_COMMIT_CLATODMA_MSGRAM0  0x400U       // Commint bit of CLA to DMA MSG
                                               // RAM control fields
#define MEMCFG_MSGXCOMMIT_COMMIT_DMATOCLA_MSGRAM1  0x800U       // Commint bit of DMA to CLA MSG
                                               // RAM control fields

//*****************************************************************************
//
// The following are defines for the bit fields in the MSGXACCPROT0 register
//
//*****************************************************************************
#define MEMCFG_MSGXACCPROT0_CPUWRPROT_CPUTOCPU_MSGRAM0  0x2U         // CPU WR Protection For
                                               // CPUTOCPU_MSGRAM0 RAM
#define MEMCFG_MSGXACCPROT0_DMAWRPROT_CPUTOCPU_MSGRAM0  0x4U         // DMA WR Protection For
                                               // CPUTOCPU_MSGRAM0 RAM

//*****************************************************************************
//
// The following are defines for the bit fields in the MSGXACCPROT1 register
//
//*****************************************************************************
#define MEMCFG_MSGXACCPROT1_CPUWRPROT_CPUTOCPU_MSGRAM1  0x2000000U   // CPU WR Protection For
                                               // CPUTOCPU_MSGRAM1 RAM
#define MEMCFG_MSGXACCPROT1_DMAWRPROT_CPUTOCPU_MSGRAM1  0x4000000U   // DMA WR Protection For
                                               // CPUTOCPU_MSGRAM1RAM

//*****************************************************************************
//
// The following are defines for the bit fields in the MSGXACCPROT2 register
//
//*****************************************************************************
#define MEMCFG_MSGXACCPROT2_CPUWRPROT_CPUTOCM_MSGRAM0  0x2U         // CPU WR Protection For
                                               // CPUTOCM_MSGRAM0 RAM
#define MEMCFG_MSGXACCPROT2_DMAWRPROT_CPUTOCM_MSGRAM0  0x4U         // DMA WR Protection For
                                               // CPUTOCM_MSGRAM0 RAM
#define MEMCFG_MSGXACCPROT2_CPUWRPROT_CPUTOCM_MSGRAM1  0x200U       // CPU WR Protection For
                                               // CPUTOCM_MSGRAM1 RAM
#define MEMCFG_MSGXACCPROT2_DMAWRPROT_CPUTOCM_MSGRAM1  0x400U       // DMA WR Protection For
                                               // CPUTOCM_MSGRAM1RAM

//*****************************************************************************
//
// The following are defines for the bit fields in the MSGXTEST register
//
//*****************************************************************************
#define MEMCFG_MSGXTEST_TEST_CPUTOCPU_MSGRAM0_S  0U
#define MEMCFG_MSGXTEST_TEST_CPUTOCPU_MSGRAM0_M  0x3U         // CPU to CPU Mode Select
#define MEMCFG_MSGXTEST_TEST_CPUTOCLA1_S  2U
#define MEMCFG_MSGXTEST_TEST_CPUTOCLA1_M  0xCU         // CPU to CLA1 MSG RAM Mode
                                               // Select
#define MEMCFG_MSGXTEST_TEST_CLA1TOCPU_S  4U
#define MEMCFG_MSGXTEST_TEST_CLA1TOCPU_M  0x30U        // CLA1 to CPU MSG RAM Mode
                                               // Select
#define MEMCFG_MSGXTEST_TEST_CLA1TODMA_S  10U
#define MEMCFG_MSGXTEST_TEST_CLA1TODMA_M  0xC00U       // CLA1 to DMA MSG RAM Mode
                                               // Select
#define MEMCFG_MSGXTEST_TEST_DMATOCLA1_S  12U
#define MEMCFG_MSGXTEST_TEST_DMATOCLA1_M  0x3000U      // DMA to CLA1 MSG RAM Mode
                                               // Select
#define MEMCFG_MSGXTEST_TEST_CPUTOCPU_MSGRAM1_S  14U
#define MEMCFG_MSGXTEST_TEST_CPUTOCPU_MSGRAM1_M  0xC000U      // CPU to CPU Mode Select
#define MEMCFG_MSGXTEST_TEST_CPUTOCM_MSGRAM0_S  16U
#define MEMCFG_MSGXTEST_TEST_CPUTOCM_MSGRAM0_M  0x30000U     // CPU to CM Mode Select
#define MEMCFG_MSGXTEST_TEST_CPUTOCM_MSGRAM1_S  18U
#define MEMCFG_MSGXTEST_TEST_CPUTOCM_MSGRAM1_M  0xC0000U     // CPU to CM Mode Select

//*****************************************************************************
//
// The following are defines for the bit fields in the MSGXINIT register
//
//*****************************************************************************
#define MEMCFG_MSGXINIT_INIT_CPUTOCPU_MSGRAM0  0x1U         // Initialization control for
                                               // CPU to CPU MSG RAM0
#define MEMCFG_MSGXINIT_INIT_CPUTOCLA1  0x2U         // Initialization control for
                                               // CPUTOCLA1 MSG RAM
#define MEMCFG_MSGXINIT_INIT_CLA1TOCPU  0x4U         // Initialization control for
                                               // CLA1TOCPU MSG RAM
#define MEMCFG_MSGXINIT_INIT_CLA1TODMA  0x20U        // Initialization control for
                                               // CLA1 to DMA MSG RAM
#define MEMCFG_MSGXINIT_INIT_DMATOCLA1  0x40U        // Initialization control for
                                               // DMA to CLA1 MSG RAM
#define MEMCFG_MSGXINIT_INIT_CPUTOCPU_MSGRAM1  0x80U        // Initialization control for
                                               // CPU to CPU MSG RAM1
#define MEMCFG_MSGXINIT_INIT_CPUTOCM_MSGRAM0  0x100U       // Initialization control for
                                               // CPU to CM MSG RAM0
#define MEMCFG_MSGXINIT_INIT_CPUTOCM_MSGRAM1  0x200U       // Initialization control for
                                               // CPU to CM MSG RAM1

//*****************************************************************************
//
// The following are defines for the bit fields in the MSGXINITDONE register
//
//*****************************************************************************
#define MEMCFG_MSGXINITDONE_INITDONE_CPUTOCPU_MSGRAM0  0x1U         // Initialization status for CPU
                                               // to CPU MSG RAM
#define MEMCFG_MSGXINITDONE_INITDONE_CPUTOCLA1  0x2U         // Initialization status for CPU
                                               // to CLA1 MSG RAM
#define MEMCFG_MSGXINITDONE_INITDONE_CLA1TOCPU  0x4U         // Initialization status for
                                               // CLA1 to CPU MSG RAM
#define MEMCFG_MSGXINITDONE_INITDONE_CLA1TODMA  0x20U        // Initialization status for
                                               // CLA1 to DMA MSG RAM
#define MEMCFG_MSGXINITDONE_INITDONE_DMATOCLA1  0x40U        // Initialization status for DMA
                                               // to CLA1 MSG RAM
#define MEMCFG_MSGXINITDONE_INITDONE_CPUTOCPU_MSGRAM1  0x80U        // Initialization status for CPU
                                               // to CPU MSG RAM1
#define MEMCFG_MSGXINITDONE_INITDONE_CPUTOCM_MSGRAM0  0x100U       // Initialization status for CPU
                                               // to CM MSG RAM0
#define MEMCFG_MSGXINITDONE_INITDONE_CPUTOCM_MSGRAM1  0x200U       // Initialization status for CPU
                                               // to CM MSG RAM1

//*****************************************************************************
//
// The following are defines for the bit fields in the MSGXRAMTEST_LOCK register
//
//*****************************************************************************
#define MEMCFG_MSGXRAMTEST_LOCK_CPUTOCPU_MSGRAM0  0x1U         //
                                               // MSGxTEST.TEST_CPUTOCPU_MSGRAM0 LOCK
#define MEMCFG_MSGXRAMTEST_LOCK_CPUTOCLA1  0x2U         // MSGxTEST.TEST_CPUTOCLA1 LOCK
#define MEMCFG_MSGXRAMTEST_LOCK_CLA1TOCPU  0x4U         // MSGxTEST.TEST_CLA1TOCPU LOCK
#define MEMCFG_MSGXRAMTEST_LOCK_CPUTOCLA2  0x8U         // MSGxTEST.TEST_CPUTOCLA2 LOCK
#define MEMCFG_MSGXRAMTEST_LOCK_CLA2TOCPU  0x10U        // MSGxTEST.TEST_CLA2TOCPU LOCK
#define MEMCFG_MSGXRAMTEST_LOCK_CLA1TODMA  0x20U        // MSGxTEST.TEST_CLA1TODMA LOCK
#define MEMCFG_MSGXRAMTEST_LOCK_DMATOCLA1  0x40U        // MSGxTEST.TEST_DMATOCLA1 LOCK
#define MEMCFG_MSGXRAMTEST_LOCK_CPUTOCPU_MSGRAM1  0x80U        //
                                               // MSGxTEST.TEST_CPUTOCPU_MSGRAM1 LOCK
#define MEMCFG_MSGXRAMTEST_LOCK_CPUTOCM_MSGRAM0  0x100U       // MSGxTEST.TEST_CPUTOCM_MSGRAM0
                                               // LOCK
#define MEMCFG_MSGXRAMTEST_LOCK_CPUTOCM_MSGRAM1  0x200U       // MSGxTEST.TEST_CPUTOCM_MSGRAM1
                                               // LOCK
#define MEMCFG_MSGXRAMTEST_LOCK_CLA2TODMA  0x400U       // MSGxTEST.TEST_CLA2TODMA LOCK
#define MEMCFG_MSGXRAMTEST_LOCK_DMATOCLA2  0x800U       // MSGxTEST.TEST_DMATOCLA2 LOCK
#define MEMCFG_MSGXRAMTEST_LOCK_KEY_S  16U
#define MEMCFG_MSGXRAMTEST_LOCK_KEY_M  0xFFFF0000U  // KEY field

//*****************************************************************************
//
// The following are defines for the bit fields in the ROM_LOCK register
//
//*****************************************************************************
#define MEMCFG_ROM_LOCK_LOCK_BOOTROM  0x1U         // BOOTROM Lock bits
#define MEMCFG_ROM_LOCK_LOCK_SECUREROM  0x2U         // SECUREROM Lock bits
#define MEMCFG_ROM_LOCK_LOCK_CLADATAROM  0x4U         // CLADATAROM Lock bits
#define MEMCFG_ROM_LOCK_KEY_S     16U
#define MEMCFG_ROM_LOCK_KEY_M     0xFFFF0000U  // KEY field

//*****************************************************************************
//
// The following are defines for the bit fields in the ROM_TEST register
//
//*****************************************************************************
#define MEMCFG_ROM_TEST_TEST_BOOTROM_S  0U
#define MEMCFG_ROM_TEST_TEST_BOOTROM_M  0x3U         // Selects the different modes
                                               // for BOOTROM
#define MEMCFG_ROM_TEST_TEST_SECUREROM_S  2U
#define MEMCFG_ROM_TEST_TEST_SECUREROM_M  0xCU         // Selects the different modes
                                               // for SECUREROM
#define MEMCFG_ROM_TEST_TEST_CLADATAROM_S  4U
#define MEMCFG_ROM_TEST_TEST_CLADATAROM_M  0x30U        // Selects the different modes
                                               // for CLADATAROM

//*****************************************************************************
//
// The following are defines for the bit fields in the ROM_FORCE_ERROR register
//
//*****************************************************************************
#define MEMCFG_ROM_FORCE_ERROR_FORCE_BOOTROM_ERROR  0x1U         // Force Bootrom Parity Error
#define MEMCFG_ROM_FORCE_ERROR_FORCE_SECUREROM_ERROR  0x2U         // Force SECUREROM Parity Error
#define MEMCFG_ROM_FORCE_ERROR_FORCE_CLADATAROM_ERROR  0x4U         // Force CLADATAROM Parity Error

//*****************************************************************************
//
// The following are defines for the bit fields in the PERI_MEM_TEST_LOCK register
//
//*****************************************************************************
#define MEMCFG_PERI_MEM_TEST_LOCK_LOCK_PERI_MEM_TEST_CONTROL  0x1U         // PERI_MEM_TEST_CONTROL Lock
                                               // bit
#define MEMCFG_PERI_MEM_TEST_LOCK_KEY_S  16U
#define MEMCFG_PERI_MEM_TEST_LOCK_KEY_M  0xFFFF0000U  // KEY field

//*****************************************************************************
//
// The following are defines for the bit fields in the PERI_MEM_TEST_CONTROL register
//
//*****************************************************************************
#define MEMCFG_PERI_MEM_TEST_CONTROL_ETHERCAT_TEST_ENABLE  0x10U        // EtherCAT Test mode enable
#define MEMCFG_PERI_MEM_TEST_CONTROL_ETHERCAT_MEM_FORCE_ERROR  0x20U        // Force Parity Error on
                                               // EtherCAT RAM

//*****************************************************************************
//
// The following are defines for the bit fields in the EMIF1LOCK register
//
//*****************************************************************************
#define MEMCFG_EMIF1LOCK_LOCK_EMIF1  0x1U         // EMIF1 access protection and
                                               // master select fields lock bit

//*****************************************************************************
//
// The following are defines for the bit fields in the EMIF1COMMIT register
//
//*****************************************************************************
#define MEMCFG_EMIF1COMMIT_COMMIT_EMIF1  0x1U         // EMIF1 access protection and
                                               // master select permanent lock

//*****************************************************************************
//
// The following are defines for the bit fields in the EMIF1MSEL register
//
//*****************************************************************************
#define MEMCFG_EMIF1MSEL_MSEL_EMIF1_S  0U
#define MEMCFG_EMIF1MSEL_MSEL_EMIF1_M  0x3U         // Master Select for EMIF1.
#define MEMCFG_EMIF1MSEL_KEY_S    4U
#define MEMCFG_EMIF1MSEL_KEY_M    0xFFFFFFF0U  // KEY to enable the write into
                                               // MSEL_EMIF1 bits

//*****************************************************************************
//
// The following are defines for the bit fields in the EMIF1ACCPROT0 register
//
//*****************************************************************************
#define MEMCFG_EMIF1ACCPROT0_FETCHPROT_EMIF1  0x1U         // Fetch Protection For EMIF1
#define MEMCFG_EMIF1ACCPROT0_CPUWRPROT_EMIF1  0x2U         // CPU WR Protection For EMIF1
#define MEMCFG_EMIF1ACCPROT0_DMAWRPROT_EMIF1  0x4U         // DMA WR Protection For EMIF1

//*****************************************************************************
//
// The following are defines for the bit fields in the EMIF2LOCK register
//
//*****************************************************************************
#define MEMCFG_EMIF2LOCK_LOCK_EMIF2  0x1U         // EMIF2 access protection and
                                               // master select permanent lock

//*****************************************************************************
//
// The following are defines for the bit fields in the EMIF2COMMIT register
//
//*****************************************************************************
#define MEMCFG_EMIF2COMMIT_COMMIT_EMIF2  0x1U         // EMIF2 access protection and
                                               // master select permanent lock

//*****************************************************************************
//
// The following are defines for the bit fields in the EMIF2ACCPROT0 register
//
//*****************************************************************************
#define MEMCFG_EMIF2ACCPROT0_FETCHPROT_EMIF2  0x1U         // Fetch Protection For EMIF2
#define MEMCFG_EMIF2ACCPROT0_CPUWRPROT_EMIF2  0x2U         // CPU WR Protection For EMIF2

//*****************************************************************************
//
// The following are defines for the bit fields in the NMAVFLG register
//
//*****************************************************************************
#define MEMCFG_NMAVFLG_CPUREAD    0x1U         // Non Master CPU Read Access
                                               // Violation Flag
#define MEMCFG_NMAVFLG_CPUWRITE   0x2U         // Non Master CPU Write Access
                                               // Violation Flag
#define MEMCFG_NMAVFLG_CPUFETCH   0x4U         // Non Master CPU Fetch Access
                                               // Violation Flag
#define MEMCFG_NMAVFLG_DMAWRITE   0x8U         // Non Master DMA Write Access
                                               // Violation Flag
#define MEMCFG_NMAVFLG_CLA1READ   0x10U        // Non Master CLA1 Read Access
                                               // Violation Flag
#define MEMCFG_NMAVFLG_CLA1WRITE  0x20U        // Non Master CLA1 Write Access
                                               // Violation Flag
#define MEMCFG_NMAVFLG_CLA1FETCH  0x40U        // Non Master CLA1 Fetch Access
                                               // Violation Flag
#define MEMCFG_NMAVFLG_DMAREAD    0x400U       // Non Master DMA read Access
                                               // Violation Flag

