maxboss10086/max_dsp/max/F28388D/F28388_empty_project/device/driverlib/inc/hw_memcfg.h
//*****************************************************************************
//
// The following are defines for the bit fields in the NMAVSET register
//
//*****************************************************************************
#define MEMCFG_NMAVSET_CPUREAD    0x1U         // Non Master CPU Read Access
                                               // Violation Flag Set
#define MEMCFG_NMAVSET_CPUWRITE   0x2U         // Non Master CPU Write Access
                                               // Violation Flag Set
#define MEMCFG_NMAVSET_CPUFETCH   0x4U         // Non Master CPU Fetch Access
                                               // Violation Flag Set
#define MEMCFG_NMAVSET_DMAWRITE   0x8U         // Non Master DMA Write Access
                                               // Violation Flag Set
#define MEMCFG_NMAVSET_CLA1READ   0x10U        // Non Master CLA1 Read Access
                                               // Violation Flag Set
#define MEMCFG_NMAVSET_CLA1WRITE  0x20U        // Non Master CLA1 Write Access
                                               // Violation Flag Set
#define MEMCFG_NMAVSET_CLA1FETCH  0x40U        // Non Master CLA1 Fetch Access
                                               // Violation Flag Set
#define MEMCFG_NMAVSET_DMAREAD    0x400U       // Non Master DMA read Access
                                               // Violation Flag Set

//*****************************************************************************
//
// The following are defines for the bit fields in the NMAVCLR register
//
//*****************************************************************************
#define MEMCFG_NMAVCLR_CPUREAD    0x1U         // Non Master CPU Read Access
                                               // Violation Flag Clear
#define MEMCFG_NMAVCLR_CPUWRITE   0x2U         // Non Master CPU Write Access
                                               // Violation Flag Clear
#define MEMCFG_NMAVCLR_CPUFETCH   0x4U         // Non Master CPU Fetch Access
                                               // Violation Flag Clear
#define MEMCFG_NMAVCLR_DMAWRITE   0x8U         // Non Master DMA Write Access
                                               // Violation Flag Clear
#define MEMCFG_NMAVCLR_CLA1READ   0x10U        // Non Master CLA1 Read Access
                                               // Violation Flag Clear
#define MEMCFG_NMAVCLR_CLA1WRITE  0x20U        // Non Master CLA1 Write Access
                                               // Violation Flag Clear
#define MEMCFG_NMAVCLR_CLA1FETCH  0x40U        // Non Master CLA1 Fetch Access
                                               // Violation Flag Clear
#define MEMCFG_NMAVCLR_DMAREAD    0x400U       // Non Master DMA read Access
                                               // Violation Flag Clear

//*****************************************************************************
//
// The following are defines for the bit fields in the NMAVINTEN register
//
//*****************************************************************************
#define MEMCFG_NMAVINTEN_CPUREAD  0x1U         // Non Master CPU Read Access
                                               // Violation Interrupt Enable
#define MEMCFG_NMAVINTEN_CPUWRITE  0x2U         // Non Master CPU Write Access
                                               // Violation Interrupt Enable
#define MEMCFG_NMAVINTEN_CPUFETCH  0x4U         // Non Master CPU Fetch Access
                                               // Violation Interrupt Enable
#define MEMCFG_NMAVINTEN_DMAWRITE  0x8U         // Non Master DMA Write Access
                                               // Violation Interrupt Enable
#define MEMCFG_NMAVINTEN_CLA1READ  0x10U        // Non Master CLA1 Read Access
                                               // Violation Interrupt Enable
#define MEMCFG_NMAVINTEN_CLA1WRITE  0x20U        // Non Master CLA1 Write Access
                                               // Violation Interrupt Enable
#define MEMCFG_NMAVINTEN_CLA1FETCH  0x40U        // Non Master CLA1 Fetch Access
                                               // Violation Interrupt Enable
#define MEMCFG_NMAVINTEN_DMAREAD  0x400U       // Non Master DMA Read Access
                                               // Violation Interrupt Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the MAVFLG register
//
//*****************************************************************************
#define MEMCFG_MAVFLG_CPUFETCH    0x1U         // Master CPU Fetch Access
                                               // Violation Flag
#define MEMCFG_MAVFLG_CPUWRITE    0x2U         // Master CPU Write Access
                                               // Violation Flag
#define MEMCFG_MAVFLG_DMAWRITE    0x4U         // Master DMA Write Access
                                               // Violation Flag

//*****************************************************************************
//
// The following are defines for the bit fields in the MAVSET register
//
//*****************************************************************************
#define MEMCFG_MAVSET_CPUFETCH    0x1U         // Master CPU Fetch Access
                                               // Violation Flag Set
#define MEMCFG_MAVSET_CPUWRITE    0x2U         // Master CPU Write Access
                                               // Violation Flag Set
#define MEMCFG_MAVSET_DMAWRITE    0x4U         // Master DMA Write Access
                                               // Violation Flag Set

//*****************************************************************************
//
// The following are defines for the bit fields in the MAVCLR register
//
//*****************************************************************************
#define MEMCFG_MAVCLR_CPUFETCH    0x1U         // Master CPU Fetch Access
                                               // Violation Flag Clear
#define MEMCFG_MAVCLR_CPUWRITE    0x2U         // Master CPU Write Access
                                               // Violation Flag Clear
#define MEMCFG_MAVCLR_DMAWRITE    0x4U         // Master DMA Write Access
                                               // Violation Flag Clear

//*****************************************************************************
//
// The following are defines for the bit fields in the MAVINTEN register
//
//*****************************************************************************
#define MEMCFG_MAVINTEN_CPUFETCH  0x1U         // Master CPU Fetch Access
                                               // Violation Interrupt Enable
#define MEMCFG_MAVINTEN_CPUWRITE  0x2U         // Master CPU Write Access
                                               // Violation Interrupt Enable
#define MEMCFG_MAVINTEN_DMAWRITE  0x4U         // Master DMA Write Access
                                               // Violation Interrupt Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the UCERRFLG register
//
//*****************************************************************************
#define MEMCFG_UCERRFLG_CPURDERR  0x1U         // CPU Uncorrectable Read Error
                                               // Flag
#define MEMCFG_UCERRFLG_DMARDERR  0x2U         // DMA Uncorrectable Read Error
                                               // Flag
#define MEMCFG_UCERRFLG_CLA1RDERR  0x4U         // CLA1 Uncorrectable Read Error
                                               // Flag
#define MEMCFG_UCERRFLG_ECATRAMRDERR  0x10U        // ECAT RAM Read Error Flag

//*****************************************************************************
//
// The following are defines for the bit fields in the UCERRSET register
//
//*****************************************************************************
#define MEMCFG_UCERRSET_CPURDERR  0x1U         // CPU Uncorrectable Read Error
                                               // Flag Set
#define MEMCFG_UCERRSET_DMARDERR  0x2U         // DMA Uncorrectable Read Error
                                               // Flag Set
#define MEMCFG_UCERRSET_CLA1RDERR  0x4U         // CLA1 Uncorrectable Read Error
                                               // Flag Set
#define MEMCFG_UCERRSET_ECATRAMRDERR  0x10U        // ECAT RAM Read Error Flag Set

//*****************************************************************************
//
// The following are defines for the bit fields in the UCERRCLR register
//
//*****************************************************************************
#define MEMCFG_UCERRCLR_CPURDERR  0x1U         // CPU Uncorrectable Read Error
                                               // Flag Clear
#define MEMCFG_UCERRCLR_DMARDERR  0x2U         // DMA Uncorrectable Read Error
                                               // Flag Clear
#define MEMCFG_UCERRCLR_CLA1RDERR  0x4U         // CLA1 Uncorrectable Read Error
                                               // Flag Clear
#define MEMCFG_UCERRCLR_ECATRAMRDERR  0x10U        // ECAT RAM Read Error Flag
                                               // Clear

//*****************************************************************************
//
// The following are defines for the bit fields in the CERRFLG register
//
//*****************************************************************************
#define MEMCFG_CERRFLG_CPURDERR   0x1U         // CPU Correctable Read Error
                                               // Flag
#define MEMCFG_CERRFLG_DMARDERR   0x2U         // DMA Correctable Read Error
                                               // Flag
#define MEMCFG_CERRFLG_CLA1RDERR  0x4U         // CLA1 Correctable Read Error
                                               // Flag

//*****************************************************************************
//
// The following are defines for the bit fields in the CERRSET register
//
//*****************************************************************************
#define MEMCFG_CERRSET_CPURDERR   0x1U         // CPU Correctable Read Error
                                               // Flag Set
#define MEMCFG_CERRSET_DMARDERR   0x2U         // DMA Correctable Read Error
                                               // Flag Set
#define MEMCFG_CERRSET_CLA1RDERR  0x4U         // CLA1 Correctable Read Error
                                               // Flag Set

//*****************************************************************************
//
// The following are defines for the bit fields in the CERRCLR register
//
//*****************************************************************************
#define MEMCFG_CERRCLR_CPURDERR   0x1U         // CPU Correctable Read Error
                                               // Flag Clear
#define MEMCFG_CERRCLR_DMARDERR   0x2U         // DMA Correctable Read Error
                                               // Flag Clear
#define MEMCFG_CERRCLR_CLA1RDERR  0x4U         // CLA1 Correctable Read Error
                                               // Flag Clear

//*****************************************************************************
//
// The following are defines for the bit fields in the CERRCNT register
//
//*****************************************************************************
#define MEMCFG_CERRCNT_CERRCNT_S  0U
#define MEMCFG_CERRCNT_CERRCNT_M  0xFFFFU      // Correctable error count.

//*****************************************************************************
//
// The following are defines for the bit fields in the CERRTHRES register
//
//*****************************************************************************
#define MEMCFG_CERRTHRES_CERRTHRES_S  0U
#define MEMCFG_CERRTHRES_CERRTHRES_M  0xFFFFU      // Correctable error threshold.

//*****************************************************************************
//
// The following are defines for the bit fields in the CEINTFLG register
//
//*****************************************************************************
#define MEMCFG_CEINTFLG_CEINTFLAG  0x1U         // Total corrected error count
                                               // exceeded threshold flag.

//*****************************************************************************
//
// The following are defines for the bit fields in the CEINTCLR register
//
//*****************************************************************************
#define MEMCFG_CEINTCLR_CEINTCLR  0x1U         // CPU Corrected Error Threshold
                                               // Exceeded Error Clear.

//*****************************************************************************
//
// The following are defines for the bit fields in the CEINTSET register
//
//*****************************************************************************
#define MEMCFG_CEINTSET_CEINTSET  0x1U         // Total corrected error count
                                               // exceeded flag set.

//*****************************************************************************
//
// The following are defines for the bit fields in the CEINTEN register
//
//*****************************************************************************
#define MEMCFG_CEINTEN_CEINTEN    0x1U         // CPU/DMA/CLA Correctable Error
                                               // Interrupt Enable.

//*****************************************************************************
//
// The following are defines for the bit fields in the ROMWAITSTATE register
//
//*****************************************************************************
#define MEMCFG_ROMWAITSTATE_WSDISABLE  0x1U         // ROM Wait State Enable/Disable
                                               // Control

//*****************************************************************************
//
// The following are defines for the bit fields in the ROMPREFETCH register
//
//*****************************************************************************
#define MEMCFG_ROMPREFETCH_PFENABLE  0x1U         // ROM Prefetch Enable/Disable
                                               // Control

//*****************************************************************************
//
// The following are defines for the bit fields in the CPU_RAM_TEST_ERROR_STS register
//
//*****************************************************************************
#define MEMCFG_CPU_RAM_TEST_ERROR_STS_COR_ERROR  0x1U         // COR_ERROR flag
#define MEMCFG_CPU_RAM_TEST_ERROR_STS_UNC_ERROR  0x2U         // UNC_ERROR flag

//*****************************************************************************
//
// The following are defines for the bit fields in the CPU_RAM_TEST_ERROR_STS_CLR register
//
//*****************************************************************************
#define MEMCFG_CPU_RAM_TEST_ERROR_STS_CLR_COR_ERROR  0x1U         // COR_ERROR flag clear bit
#define MEMCFG_CPU_RAM_TEST_ERROR_STS_CLR_UNC_ERROR  0x2U         // UNC_ERROR flag clear bit
#endif
